
## :white_check_mark: Apply Succeeded (pocket-event-bridge-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/78338)



<pre><code>Apply complete! Resources: 6 added, 1 changed, 4 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
null_resource.user-api-events: Refreshing state... [id=1640281684023204663]
null_resource.user-registration: Refreshing state... [id=1054849530497827920]
aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_D8FF29D4: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ForgotPassword-Rule-Rule]
aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPassword-SNS-Target_29B21C23: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ForgotPassword-Rule-Rule-PocketEventBridge-Dev-ForgotPassword-SNS-Target]
aws_cloudwatch_metric_alarm.forgot-password_forgotpassword-rule-dlq-alarm_DE6678D2: Refreshing state... [id=PocketEventBridge-Dev-ForgotPassword-rule-dlq-alarm]
aws_sns_topic.collection-events_collection-event-topic_343F754D: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-CollectionEventTopic]
aws_sns_topic.user-api-events_user-event-topic_BF85AC87: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic]
aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33: Refreshing state... [id=user-events/PocketEventBus]
aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D: Refreshing state... [id=Forgot-Password-Request/PocketEventBus]
aws_sns_topic.adm-events_user-merge-topic_59FD8EDC: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserMerge-Topic]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Non-Critical]
data.aws_sqs_queue.prospect-events_prospect-Dev-dlq_437725F7: Reading...
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Dev-EventTracker-EventBridge-Rule_event-bridge-rule_4E64BB98: Refreshing state... [id=PocketEventBridge-Dev-EventTracker-Rule-Rule]
aws_sns_topic.forgot-password_forgot-password-topic_37468B69: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic]
aws_sns_topic.list-api-events_list-event-topic_8792A1B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ListEventTopic]
aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60: Refreshing state... [id=queue-check-delete/PocketEventBus]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_46A95BB9: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserMerge-Rule-Rule]
data.aws_sqs_queue.prospect-events_prospect-Dev-dlq_437725F7: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue-Deadletter]
aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-PremiumPurchase-SNS-Topic-Event-Rule-DLQ]
aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-UserEvents-Topic-Rule-DLQ]
aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-CollectionEvents-Event-Rule-DLQ]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Critical]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue_9971A44C: Reading...
aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Dev-PremiumPurchase-EventBridge-Rule_event-bridge-rule_7735469E: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-PremiumPurchase-Rule-Rule]
aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Dev-Shared-Event-Bus_49D29B26: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus]
aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3: Refreshing state... [id=User-Registration-Event/PocketEventBus]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue-dlq_67C0CEB2: Reading...
aws_sns_topic.prospect-events_prospect-event-topic_59EF07AC: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ProspectEventTopic]
aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-UserMerge-SNS-Topic-DLQ]
aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue-dlq_67C0CEB2: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue-Deadletter]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue_9971A44C: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue]
aws_sns_topic.shareable-list-item-events_shareable-list-item-event-topic_C6825838: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListItemEventTopic]
aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419: Refreshing state... [id=Premium-Renewal-Upcoming/PocketEventBus]
aws_sns_topic.premium-purchase_premium-purchase-topic_B49B01E4: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-PremiumPurchase-Topic]
data.aws_caller_identity.all-events_caller_20BD1C35: Reading...
aws_sns_topic.user-registration_user-registration-topic_1A7AE012: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserRegistrationTopic]
data.aws_caller_identity.all-events_caller_20BD1C35: Read complete after 0s [id=410318598490]
data.terraform_remote_state.incident_management: Read complete after 1s
aws_cloudwatch_event_rule.user-registration_PocketEventBridge-Dev-User-Registration-EventBridge-Rule_event-bridge-rule_57265A16: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserRegistration-Rule-Rule]
aws_sqs_queue.user-registration_sns-topic-dql_811A5411: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-UserRegistration-Topic--DLQ]
aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-ShareableListEvents-Topic-DLQ]
aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59: Refreshing state... [id=Premium-Purchase/PocketEventBus]
aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ListApiEvents-Topic-Rule-DLQ]
aws_sns_topic.shareable-list-events_shareable-list-event-topic_0122F098: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListEventTopic]
data.aws_region.all-events_region_F90A933E: Reading...
aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B: Refreshing state... [id=user-merge/PocketEventBus]
data.aws_region.all-events_region_F90A933E: Read complete after 0s [id=us-east-1]
data.aws_sqs_queue.prospect-events_prospect-Dev-queue_E020D8EE: Reading...
aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-ShareableListItemEvents-Topic-DLQ]
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_09BB5CFB: Reading...
aws_cloudwatch_log_group.all-events_all-event-log-group_7F02C8C4: Refreshing state... [id=/aws/events/PocketEventBridge/AllEvents]
data.aws_iam_policy_document.adm-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E5FB144D: Reading...
data.aws_iam_policy_document.adm-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E5FB144D: Read complete after 0s [id=2368812478]
data.aws_iam_policy_document.collection-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_7E9EBC8B: Reading...
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_09BB5CFB: Read complete after 0s [id=1858380603]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.aws_iam_policy_document.collection-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_7E9EBC8B: Read complete after 0s [id=558847036]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
aws_cloudwatch_metric_alarm.prospect-events_prospectevents-rule-dlq-alarm_8841D120: Refreshing state... [id=PocketEventBridge-Dev-ProspectEvents-Rule-DLQ-Alarm]
aws_cloudwatch_metric_alarm.premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2: Refreshing state... [id=PocketEventBridge-Dev-PremiumPurchase-rule-dlq-alarm]
data.aws_sqs_queue.prospect-events_prospect-Dev-queue_E020D8EE: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue]
aws_cloudwatch_metric_alarm.user-api-events_userevents-rule-dlq-alarm_A6972B78: Refreshing state... [id=PocketEventBridge-Dev-UserEvents-Rule-dlq-alarm]
null_resource.adm-events_null-resource_C7D19F6F: Refreshing state... [id=686595610515218195]
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_56495939: Reading...
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_56495939: Read complete after 0s [id=1536945497]
aws_cloudwatch_metric_alarm.collection-events_collectionevents-rule-dlq-alarm_9543404D: Refreshing state... [id=PocketEventBridge-Dev-CollectionEvents-Rule-dlq-alarm]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Dev-EventTracker-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Dev-EventTracker-Rule-Target_0FA8570E: Refreshing state... [id=PocketEventBridge-Dev-EventTracker-Rule-Rule-AccountDeleteMonitor-Dev-EventTracker-Rule-Target]
aws_cloudwatch_metric_alarm.adm-events_pocketeventbridge-dev-dlq-alarm_BCAE7713: Refreshing state... [id=PocketEventBridge-Dev-PocketEventBridge-Dev-Dlq-Alarm]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Dev-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_A86C3809: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-Prospect-Dismiss-Event-Rule-Rule]
aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Dev-Collection-Api-EventBridge-Rule_event-bridge-rule_FF7503E5: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-CollectionEvents-Rule-Rule]
aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Dev-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_3EB93B4A: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ShareableListItemEvents-Rule-Rule]
aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Dev-Shareable-List-EventBridge-Rule_event-bridge-rule_8AF00B8D: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ShareableListEvents-Rule-Rule]
aws_cloudwatch_event_rule.all-events_PocketEventBridge-Dev-AllEvents-EventBridge-Rule_event-bridge-rule_670DBE2D: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-AllEvents-Rule-Rule]
aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Dev-User-Api-EventBridge-Rule_event-bridge-rule_CD10601E: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserEvents-Rule-Rule]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Dev-Prospect-Prod-EventBridge-Rule_event-bridge-rule_61DEA3A5: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ProspectEvents-Rule-Rule]
aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Dev-List-Api-EventBridge-Rule_event-bridge-rule_0EE34A09: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ListApiEvents-Rule-Rule]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_3BE5D0A5: Reading...
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_3BE5D0A5: Read complete after 0s [id=4079020960]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PB4TRMW]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PXV5RN6]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Dev-UserMerge-Rule-Target_464B97D5: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-UserMerge-Rule-Rule-AccountDeleteMonitor-Dev-UserMerge-Rule-Target]
null_resource.premium-purchase_null-resource_E2C3B0AC: Refreshing state... [id=2431405901146229294]
data.aws_iam_policy_document.user-registration_PocketEventBridge-Dev-EventBridge-SNS-Policy_5C4372D1: Reading...
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_84ACA1D5: Reading...
aws_cloudwatch_event_target.premium-purchase_PocketEventBridge-Dev-PremiumPurchase-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-PremiumPurchase-SNS-Target_16A7E60C: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-PremiumPurchase-Rule-Rule-PocketEventBridge-Dev-PremiumPurchase-SNS-Target]
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Dev-EventBridge-SNS-Policy_A531B333: Reading...
data.aws_iam_policy_document.user-registration_PocketEventBridge-Dev-EventBridge-SNS-Policy_5C4372D1: Read complete after 0s [id=398711402]
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Dev-EventBridge-SNS-Policy_A531B333: Read complete after 0s [id=2786568925]
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Refreshing state... [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_84ACA1D5: Read complete after 0s [id=4158017153]
null_resource.forgot-password_null-resource_6A54B276: Refreshing state... [id=4602880778711893649]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_iam_policy_document.all-events_PocketEventBridge-Dev-EventBridge-Cloudwatch-Policy_17B7298B: Reading...
null_resource.user-registration_null-resource_B04CACC3: Refreshing state... [id=2164411739781809868]
aws_cloudwatch_event_target.user-registration_PocketEventBridge-Dev-User-Registration-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-User-Registration-Event-SNS-Target_5050627A: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-UserRegistration-Rule-Rule-PocketEventBridge-Dev-User-Registration-Event-SNS-Target]
data.aws_iam_policy_document.all-events_PocketEventBridge-Dev-EventBridge-Cloudwatch-Policy_17B7298B: Read complete after 0s [id=871958777]
aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic]
aws_sns_topic_policy.adm-events_user-events-sns-topic-policy_311E9FD7: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserMerge-Topic]
aws_sns_topic_policy.forgot-password_forgot-password-sns-topic-policy_32893F3B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic]
aws_cloudwatch_metric_alarm.list-api-events_listapievents-rule-dlq-alarm_9E16078F: Refreshing state... [id=PocketEventBridge-Dev-ListApiEvents-Rule-dlq-alarm]
aws_sns_topic_policy.collection-events_collection-events-sns-topic-policy_65FE0430: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-CollectionEventTopic]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-Prospect-Event-SQS-Policy_A24BDD58: Reading...
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Refreshing state... [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ListEventTopic]
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E3B52D6F: Reading...
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-Prospect-Event-SQS-Policy_A24BDD58: Read complete after 0s [id=2939629240]
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E3B52D6F: Read complete after 0s [id=3177284822]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Dev-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Prospect-Event-SNS-Target_594EAF60: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-Prospect-Dismiss-Event-Rule-Rule-PocketEventBridge-Dev-Prospect-Event-SNS-Target]
null_resource.prospect-events_null-resource_BF542108: Refreshing state... [id=73097855203687419]
null_resource.shareable-list-item-events_null-resource_46056FE2: Refreshing state... [id=7821674224914414466]
null_resource.collection-events_null-resource_9F908E27: Refreshing state... [id=832091505403206886]
aws_cloudwatch_event_target.shareable-list-item-events_PocketEventBridge-Dev-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Shareable-List-Item-Event-SNS-Target_BCC10972: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ShareableListItemEvents-Rule-Rule-PocketEventBridge-Dev-Shareable-List-Item-Event-SNS-Target]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ProspectEventTopic]
aws_cloudwatch_event_target.collection-events_PocketEventBridge-Dev-Collection-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Collection-Event-SNS-Target_FEA1C077: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-CollectionEvents-Rule-Rule-PocketEventBridge-Dev-Collection-Event-SNS-Target]
null_resource.shareable-list-events_null-resource_78AB9CC2: Refreshing state... [id=7514281831826198604]
aws_cloudwatch_event_target.shareable-list-events_PocketEventBridge-Dev-Shareable-List-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Shareable-List-Event-SNS-Target_516DAD68: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ShareableListEvents-Rule-Rule-PocketEventBridge-Dev-Shareable-List-Event-SNS-Target]
null_resource.all-events_null-resource_9E05AD52: Refreshing state... [id=233714570357470671]
null_resource.list-api-events_null-resource_D711C801: Refreshing state... [id=4790634215299972220]
aws_cloudwatch_event_target.all-events_PocketEventBridge-Dev-AllEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-All-Events-CloudWatch-Target_0700E6AB: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-AllEvents-Rule-Rule-PocketEventBridge-Dev-All-Events-CloudWatch-Target]
null_resource.user-api-events_null-resource_C0C836FA: Refreshing state... [id=2732232843318932070]
aws_cloudwatch_event_target.user-api-events_PocketEventBridge-Dev-User-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-User-Event-SNS-Target_AC72C0FA: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-UserEvents-Rule-Rule-PocketEventBridge-Dev-User-Event-SNS-Target]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Dev-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Prospect-Event-SQS-Target_21AE1E27: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ProspectEvents-Rule-Rule-PocketEventBridge-Dev-Prospect-Event-SQS-Target]
aws_sns_topic_policy.user-registration_user-registration-events-sns-topic-policy_15EC0C3C: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserRegistrationTopic]
aws_cloudwatch_event_target.list-api-events_PocketEventBridge-Dev-List-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-List-Event-SNS-Target_AEFA7A5C: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ListApiEvents-Rule-Rule-PocketEventBridge-Dev-List-Event-SNS-Target]
aws_cloudwatch_log_resource_policy.all-events_all-events-cloudwatch-policy_AAF6FEAB: Refreshing state... [id=PocketEventBridge-Dev-AllEvents-CloudwatchPolicy]
aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListItemEventTopic]
aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-PremiumPurchase-Topic]
aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListEventTopic]
aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=POEU6LN]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PW038Q0]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PZZR92Q]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PSQF7AA]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Critical:095550a0-ad2e-488f-8a65-ebf52e809a97]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Non-Critical:1840ffe4-8fd4-492b-b9b7-04bbf22e595a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_sns_topic.forgot-password_forgot-password-topic_37468B69 has been deleted
  - resource "aws_sns_topic" "forgot-password_forgot-password-topic_37468B69" {
      - arn                                      = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic" -> null
        id                                       = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic"
        name                                     = "PocketEventBridge-Dev-ForgotPassword-Topic"
        tags                                     = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.forgot-password_PocketEventBridge-Dev-EventBridge-SNS-Policy_63F4865E will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forgot-password_PocketEventBridge-Dev-EventBridge-SNS-Policy_63F4865E" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_D8FF29D4 will be destroyed
  # (because aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_D8FF29D4 is not in configuration)
  - resource "aws_cloudwatch_event_rule" "forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_D8FF29D4" {
      - arn            = "arn:aws:events:us-east-1:410318598490:rule/PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ForgotPassword-Rule-Rule" -> null
      - event_bus_name = "PocketEventBridge-Dev-Shared-Event-Bus" -> null
      - event_pattern  = jsonencode(
            {
              - detail-type = [
                  - "Forgot Password Request",
                ]
              - source      = [
                  - "web-repo",
                ]
            }
        ) -> null
      - id             = "PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ForgotPassword-Rule-Rule" -> null
      - is_enabled     = true -> null
      - name           = "PocketEventBridge-Dev-ForgotPassword-Rule-Rule" -> null
      - state          = "ENABLED" -> null
      - tags           = {
          - "environment" = "Dev"
          - "service"     = "PocketEventBridge"
        } -> null
      - tags_all       = {
          - "environment" = "Dev"
          - "service"     = "PocketEventBridge"
        } -> null
    }

  # aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_3B3D8151 will be created
  + resource "aws_cloudwatch_event_rule" "forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_3B3D8151" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Dev-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Forgot Password Request",
                ]
              + source      = [
                  + "web-repo",
                ]
            }
        )
      + id             = (known after apply)
      + name           = "PocketEventBridge-Dev-ForgotPasswordRequest-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags           = {
          + "environment" = "Dev"
          + "service"     = "PocketEventBridge"
        }
      + tags_all       = {
          + "environment" = "Dev"
          + "service"     = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPassword-SNS-Target_29B21C23 will be destroyed
  # (because aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPassword-SNS-Target_29B21C23 is not in configuration)
  - resource "aws_cloudwatch_event_target" "forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPassword-SNS-Target_29B21C23" {
      - arn            = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic" -> null
      - event_bus_name = "PocketEventBridge-Dev-Shared-Event-Bus" -> null
      - id             = "PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ForgotPassword-Rule-Rule-PocketEventBridge-Dev-ForgotPassword-SNS-Target" -> null
      - rule           = "PocketEventBridge-Dev-ForgotPassword-Rule-Rule" -> null
      - target_id      = "PocketEventBridge-Dev-ForgotPassword-SNS-Target" -> null

      - dead_letter_config {
          - arn = "arn:aws:sqs:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ" -> null
        }
    }

  # aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Target_C2DF574C will be created
  + resource "aws_cloudwatch_event_target" "forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Target_C2DF574C" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Dev-Shared-Event-Bus"
      + id             = (known after apply)
      + rule           = "PocketEventBridge-Dev-ForgotPasswordRequest-Rule-Rule"
      + target_id      = "PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Target"

      + dead_letter_config {
          + arn = (known after apply)
        }
    }

  # aws_cloudwatch_metric_alarm.forgot-password_forgotpassword-rule-dlq-alarm_DE6678D2 will be destroyed
  # (because aws_cloudwatch_metric_alarm.forgot-password_forgotpassword-rule-dlq-alarm_DE6678D2 is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "forgot-password_forgotpassword-rule-dlq-alarm_DE6678D2" {
      - actions_enabled           = true -> null
      - alarm_actions             = [] -> null
      - alarm_description         = "Number of messages >= 15" -> null
      - alarm_name                = "PocketEventBridge-Dev-ForgotPassword-rule-dlq-alarm" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:410318598490:alarm:PocketEventBridge-Dev-ForgotPassword-rule-dlq-alarm" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "QueueName" = "PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "PocketEventBridge-Dev-ForgotPassword-rule-dlq-alarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ApproximateNumberOfMessagesVisible" -> null
      - namespace                 = "AWS/SQS" -> null
      - ok_actions                = [] -> null
      - period                    = 900 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "environment" = "Dev"
          - "service"     = "PocketEventBridge"
        } -> null
      - threshold                 = 15 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.forgot-password_forgotpasswordrequest-rule-dlq-alarm_EAFB02F7 will be created
  + resource "aws_cloudwatch_metric_alarm" "forgot-password_forgotpasswordrequest-rule-dlq-alarm_EAFB02F7" {
      + actions_enabled                       = true
      + alarm_description                     = "Number of messages >= 15"
      + alarm_name                            = "PocketEventBridge-Dev-ForgotPasswordRequest-rule-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Topic-Event-Rule-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 900
      + statistic                             = "Sum"
      + tags_all                              = {
          + "environment" = "Dev"
          + "service"     = "PocketEventBridge"
        }
      + threshold                             = 15
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3" {
      ~ dimensions                = {
          ~ "QueueName" = "PocketEventBridge-Dev-SNS-ShareableListEvents-Topic-DLQ" -> "PocketEventBridge-Dev-SNS-ShareableListItemEvents-Topic-DLQ"
        }
        id                        = "PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_sns_topic.forgot-password_forgot-password-topic_37468B69 will be created
  + resource "aws_sns_topic" "forgot-password_forgot-password-topic_37468B69" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "PocketEventBridge-Dev-ForgotPasswordRequest-Topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "environment" = "Dev"
          + "service"     = "PocketEventBridge"
        }
      + tags_all                    = {
          + "environment" = "Dev"
          + "service"     = "PocketEventBridge"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.forgot-password_forgot-password-sns-topic-policy_32893F3B will be created
  + resource "aws_sns_topic_policy" "forgot-password_forgot-password-sns-topic-policy_32893F3B" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032 must be replaced
-/+ resource "aws_sqs_queue" "forgot-password_sns-topic-dlq_A55BE032" {
      ~ arn                               = "arn:aws:sqs:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ" -> "PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Topic-Event-Rule-DLQ" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      ~ sqs_managed_sse_enabled           = true -> (known after apply)
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
      ~ url                               = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 4 to destroy.
aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPassword-SNS-Target_29B21C23: Destroying... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ForgotPassword-Rule-Rule-PocketEventBridge-Dev-ForgotPassword-SNS-Target]
aws_cloudwatch_metric_alarm.forgot-password_forgotpassword-rule-dlq-alarm_DE6678D2: Destroying... [id=PocketEventBridge-Dev-ForgotPassword-rule-dlq-alarm]
aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_3B3D8151: Creating...
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Modifying... [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPassword-SNS-Target_29B21C23: Destruction complete after 0s
aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_D8FF29D4: Destroying... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ForgotPassword-Rule-Rule]
aws_sns_topic.forgot-password_forgot-password-topic_37468B69: Creating...
aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPassword-EventBridge-Rule_event-bridge-rule_D8FF29D4: Destruction complete after 0s
aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_3B3D8151: Creation complete after 0s [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ForgotPasswordRequest-Rule-Rule]
aws_cloudwatch_metric_alarm.forgot-password_forgotpassword-rule-dlq-alarm_DE6678D2: Destruction complete after 0s
aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032: Destroying... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ForgotPassword-SNS-Topic-Event-Rule-DLQ]
aws_sns_topic.forgot-password_forgot-password-topic_37468B69: Creation complete after 0s [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPasswordRequest-Topic]
data.aws_iam_policy_document.forgot-password_PocketEventBridge-Dev-EventBridge-SNS-Policy_63F4865E: Reading...
data.aws_iam_policy_document.forgot-password_PocketEventBridge-Dev-EventBridge-SNS-Policy_63F4865E: Read complete after 0s [id=3560033380]
aws_sns_topic_policy.forgot-password_forgot-password-sns-topic-policy_32893F3B: Creating...
aws_sns_topic_policy.forgot-password_forgot-password-sns-topic-policy_32893F3B: Creation complete after 0s [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPasswordRequest-Topic]
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Modifications complete after 0s [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032: Destruction complete after 2s
aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032: Creating...
aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032: Still creating... [10s elapsed]
aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032: Still creating... [20s elapsed]
aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032: Creation complete after 25s [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Topic-Event-Rule-DLQ]
aws_cloudwatch_metric_alarm.forgot-password_forgotpasswordrequest-rule-dlq-alarm_EAFB02F7: Creating...
aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Target_C2DF574C: Creating...
aws_cloudwatch_event_target.forgot-password_PocketEventBridge-Dev-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Target_C2DF574C: Creation complete after 0s [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ForgotPasswordRequest-Rule-Rule-PocketEventBridge-Dev-ForgotPasswordRequest-SNS-Target]
aws_cloudwatch_metric_alarm.forgot-password_forgotpasswordrequest-rule-dlq-alarm_EAFB02F7: Creation complete after 0s [id=PocketEventBridge-Dev-ForgotPasswordRequest-rule-dlq-alarm]

Apply complete! Resources: 6 added, 1 changed, 4 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"ba958afa-2656-4ac5-86da-19418daae8af","JobName":"pocket-event-bridge_infrastructure_apply_dev","PRNumber":249,"Program":"tfcmt","SHA1":"01b0b9755351243e5084273feca126509bb47a86","Target":"pocket-event-bridge-cdk-dev","Vars":{}} -->